In [78]:
import pandas as pd 
import numpy as np

In [79]:
df = pd.read_csv("../data/raw/expenses.csv")
df.head(10)

  expenseId groupId paidBy  amount category            createdAt
0        E1      G3     U5   14737     rent  2025-03-24 08:42:00
1        E2      G2     U5     292     food  2025-03-09 13:28:00
2        E3      G2     U4    7349     rent  2025-01-05 11:22:00
3        E4      G2     U5     513     food  2025-03-12 08:02:00
4        E5      G2     U2    1052    other  2025-05-14 05:33:00
5        E6      G3     U2    3647    other  2025-01-18 05:13:00
6        E7      G2     U2    2376   travel  2025-01-09 21:11:00
7        E8      G2     U2    1795   travel  2025-02-06 07:42:00
8        E9      G1     U5     517   travel  2025-05-07 18:01:00
9       E10      G1     U1    7345     rent  2025-05-11 09:37:00

In [80]:
df.shape

(500, 6)

In [81]:
df['hour'] = pd.to_datetime(df['createdAt']).dt.hour
df['date'] = pd.to_datetime(df['createdAt']).dt.date

In [82]:
df

,expenseId,groupId,paidBy,amount,category,createdAt,hour,date
0,E1,G3,U5,14737,rent,2025-03-24 08:42:00,8,2025-03-24
1,E2,G2,U5,292,food,2025-03-09 13:28:00,13,2025-03-09
2,E3,G2,U4,7349,rent,2025-01-05 11:22:00,11,2025-01-05
3,E4,G2,U5,513,food,2025-03-12 08:02:00,8,2025-03-12
4,E5,G2,U2,1052,other,2025-05-14 05:33:00,5,2025-05-14
...,...,...,...,...,...,...,...,...
495,E496,G2,U5,17424,rent,2025-05-10 08:42:00,8,2025-05-10
496,E497,G3,U5,28119,other,2025-02-23 04:07:00,4,2025-02-23
497,E498,G3,U5,2990,travel,2025-01-21 08:47:00,8,2025-01-21
498,E499,G2,U4,11247,rent,2025-06-16 10:28:00,10,2025-06-16
499,E500,G3,U1,3553,travel,2025-04-18 11:58:00,11,2025-04-18

In [85]:
numeric_feature = df[['amount', 'date', 'hour']]
numeric_feature
numeric_feature['date'] = pd.to_datetime(numeric_feature['date']).dt.floor('D')

In [87]:
numeric_feature['Day of the week'] = numeric_feature['date'].dt.dayofweek
sorted_by_hour_date = numeric_feature.sort_values(by=['date', 'hour'])

In [88]:
sorted_by_hour_date['datetime'] = pd.to_datetime(numeric_feature['date']) + pd.to_timedelta(numeric_feature['hour'], unit='h')

In [ ]:
sorted_by_hour_date = sorted_by_hour_date.sort_values('datetime')
sorted_by_hour_date['time_gap_minutes'] = sorted_by_hour_date['datetime'].diff().dt.total_seconds() / 3600
sorted_by_hour_date = sorted_by_hour_date.drop(columns=['date', 'datetime'])

KeyError: 'datetime'

In [ ]:
sorted_by_hour_date = sorted_by_hour_date.fillna(0)
sorted_by_hour_date = sorted_by_hour_date.rename(columns={'Day of the week': 'day_of_week'})

In [99]:
sorted_by_hour_date

     amount  hour  day_of_week  time_gap_minutes
201    2258     6            2               0.0
291    4884    12            2               6.0
191    5761    17            2               5.0
280    2080    21            2               4.0
350     499    10            3              13.0
..      ...   ...          ...               ...
93      589     8            6               2.0
60     2645    14            6               6.0
384    2048     7            0              17.0
143    2732    11            0               4.0
310     574    15            0               4.0

[500 rows x 4 columns]

In [103]:
final_numeric_ftr = sorted_by_hour_date
final_numeric_ftr

     amount  hour  day_of_week  time_gap_minutes
201    2258     6            2               0.0
291    4884    12            2               6.0
191    5761    17            2               5.0
280    2080    21            2               4.0
350     499    10            3              13.0
..      ...   ...          ...               ...
93      589     8            6               2.0
60     2645    14            6               6.0
384    2048     7            0              17.0
143    2732    11            0               4.0
310     574    15            0               4.0

[500 rows x 4 columns]

In [104]:
final_numeric_ftr.to_csv('../data/processed/features.csv')